src/Reports/СебестоимостьSMD/СебестоимостьSMD.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СебестоимостьSMD</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ВыполнениеЭтаповПроизводства/ВыполнениеЭтаповПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыполнениеЭтаповПроизводства</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </resources>
  <resources>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МТК</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыSMD/НормыSMD.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыSMD</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаНормоЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛинияSMD</name>
    <type>
      <types>CatalogRef.ЛинииSMD</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыОптическогоТеста/НормыОптическогоТеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыОптическогоТеста</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыЭлектроконтроля/НормыЭлектроконтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыЭлектроконтроля</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Себестоимость/Себестоимость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Себестоимость</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ЗарплатнаяЧасть</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СебестоимостьПолная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/СебестоимостьSMD/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Отчет.Период.ДатаНачала = Результат;
	Отчет.Период.ДатаОкончания = КонецМесяца(Результат);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьЛиниюSMD(МТК)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.ЛинияSMD
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование = &МТК";
Запрос.УстановитьПараметр("МТК", МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.ЛинияSMD);
	КонецЦикла;
Возврат(Справочники.ЛинииSMD.ПустаяСсылка());
КонецФункции

&НаСервере
Функция ПолучитьСписокРабочихМест(Наименование)
СписокРабочихМест = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеек.Ссылка
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек КАК РабочиеМестаЛинеек
	|ГДЕ
	|	РабочиеМестаЛинеек.Линейка В(&СписокЛинеек)
	|	И РабочиеМестаЛинеек.ПометкаУдаления = ЛОЖЬ
	|	И РабочиеМестаЛинеек.ЭтоГруппа = ЛОЖЬ
	|	И РабочиеМестаЛинеек.Наименование = &Наименование";
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
Запрос.УстановитьПараметр("Наименование", Наименование);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокРабочихМест.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
Возврат(СписокРабочихМест);
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

ПолнаяСуммаЗП = ОбщийМодульВызовСервера.ПолучитьПолнуюСуммуЗарплаты(СписокЛинеек[0].Значение.Подразделение,Справочники.Линейки.ПустаяСсылка(),Отчет.Период.ДатаОкончания);

СписокМТК = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыполнениеЭтаповПроизводства.Спецификация КАК ЭтапСпецификации,
	|	ВыполнениеЭтаповПроизводства.Количество КАК Количество,
	|	ВыполнениеЭтаповПроизводства.Период,
	|	ВыполнениеЭтаповПроизводства.МТК.Номенклатура КАК Изделие,
	|	ВыполнениеЭтаповПроизводства.Период КАК ДатаВыполнения,
	|	ВыполнениеЭтаповПроизводства.Исполнитель,
	|	ВыполнениеЭтаповПроизводства.МТК
	|ИЗ
	|	РегистрСведений.ВыполнениеЭтаповПроизводства КАК ВыполнениеЭтаповПроизводства
	|ГДЕ
	|	ВыполнениеЭтаповПроизводства.МТК.Линейка В(&СписокЛинеек)
	|	И ВыполнениеЭтаповПроизводства.Период МЕЖДУ &ДатаНач И &ДатаКон
	|
	|УПОРЯДОЧИТЬ ПО
	|	Изделие
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Изделие,
	|	ЭтапСпецификации"; 
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаИзделие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

СтоимостьВсего = 0;
	Пока ВыборкаИзделие.Следующий() Цикл
	ВыборкаСпецификация = ВыборкаИзделие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСпецификация.Следующий() Цикл
		СтоимостьУЭ = 0;
		ВыборкаДетальная = ВыборкаСпецификация.Выбрать();
			Пока ВыборкаДетальная.Следующий() Цикл
			МТК = ВыборкаДетальная.МТК;
			НормыSMD = РегистрыСведений.НормыSMD.ПолучитьПоследнее(ВыборкаДетальная.ДатаВыполнения,Новый Структура("МПЗ,ЛинияSMD",ВыборкаСпецификация.ЭтапСпецификации,ПолучитьЛиниюSMD(МТК)));
			СтоимостьУЭ = СтоимостьУЭ + ВыборкаДетальная.Количество*НормыSMD.ЦенаНормоЧаса*ВыборкаДетальная.Исполнитель.Должность.КоэффициентРазряда;
			КонецЦикла;
		СтоимостьУЭ = СтоимостьУЭ*2.05;
		НормыSMD = РегистрыСведений.НормыОптическогоТеста.ПолучитьПоследнее(Отчет.Период.ДатаОкончания,Новый Структура("МПЗ",ВыборкаСпецификация.ЭтапСпецификации));
		СтоимостьОТ = ВыборкаСпецификация.Количество*НормыSMD.Расценка*2;
		НормыSMD = РегистрыСведений.НормыЭлектроконтроля.ПолучитьПоследнее(Отчет.Период.ДатаОкончания,Новый Структура("МПЗ",ВыборкаСпецификация.ЭтапСпецификации));
		СтоимостьЭК = ВыборкаСпецификация.Количество*НормыSMD.Расценка*2;
		СтоимостьВсего = СтоимостьВсего + СтоимостьУЭ + СтоимостьОТ + СтоимостьЭК;
		КонецЦикла;
	КонецЦикла;

НомСтр = 0;
КоличествоВсего = 0;
ВремяИзготВсего = 0;
СтоимостьУЭВсего = 0;
СтоимостьОТВсего = 0;
СтоимостьЭКВсего = 0;
ВыборкаИзделие.Сбросить();
	Пока ВыборкаИзделие.Следующий() Цикл
	СебестоимостьИзделияПолная = 0;
	ВыборкаСпецификация = ВыборкаИзделие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСпецификация.Следующий() Цикл
		НомСтр = НомСтр + 1;
		ОблСтрока.Параметры.НомСтр = НомСтр;
		ОблСтрока.Параметры.Статус = ПолучитьСтатус(ВыборкаСпецификация.ЭтапСпецификации);
		ОблСтрока.Параметры.НаименованиеИзделия = СокрЛП(ВыборкаСпецификация.Изделие.Наименование);
		ОблСтрока.Параметры.Изделие = ВыборкаСпецификация.Изделие;
		ОблСтрока.Параметры.НаименованиеСпецификации = СокрЛП(ВыборкаСпецификация.ЭтапСпецификации.Наименование);
		ОблСтрока.Параметры.ЭтапСпецификации = ВыборкаСпецификация.ЭтапСпецификации;
		ОблСтрока.Параметры.Количество = ВыборкаСпецификация.Количество;
		ВыборкаДетальная = ВыборкаСпецификация.Выбрать();
		СтоимостьУЭ = 0;
		ВремяИзгот = 0;
			Пока ВыборкаДетальная.Следующий() Цикл
			МТК = ВыборкаДетальная.МТК;
			НормыSMD = РегистрыСведений.НормыSMD.ПолучитьПоследнее(ВыборкаДетальная.ДатаВыполнения,Новый Структура("МПЗ,ЛинияSMD",ВыборкаСпецификация.ЭтапСпецификации,ПолучитьЛиниюSMD(МТК)));
			СтоимостьУЭ = СтоимостьУЭ + ВыборкаДетальная.Количество*НормыSMD.ЦенаНормоЧаса*ВыборкаДетальная.Исполнитель.Должность.КоэффициентРазряда;
			ВремяИзгот = ВремяИзгот + ВыборкаДетальная.Количество*НормыSMD.НормаВремени;
			КонецЦикла;
		ОблСтрока.Параметры.НВ_УЭ = Формат(ВремяИзгот/ВыборкаСпецификация.Количество,"ЧЦ=5; ЧДЦ=2");
		ОблСтрока.Параметры.ВремяИзгот = Формат(ВремяИзгот,"ЧЦ=9; ЧДЦ=3");
		ОблСтрока.Параметры.СтоимостьУЭ = Формат(СтоимостьУЭ,"ЧЦ=9; ЧДЦ=2");
		ОблСтрока.Параметры.СтоимостьУЭ_К = Формат(СтоимостьУЭ*2.05,"ЧЦ=9; ЧДЦ=2");

		НормыSMD = РегистрыСведений.НормыОптическогоТеста.ПолучитьПоследнее(Отчет.Период.ДатаОкончания,Новый Структура("МПЗ",ВыборкаСпецификация.ЭтапСпецификации));
		ОблСтрока.Параметры.КоэффициентОТ = Формат(НормыSMD.Коэффициент,"ЧЦ=4; ЧДЦ=2");
		ОблСтрока.Параметры.РасценкаОТ = Формат(НормыSMD.Расценка,"ЧЦ=4; ЧДЦ=2");
		СтоимостьОТ = ВыборкаСпецификация.Количество*НормыSMD.Расценка;
		ОблСтрока.Параметры.СтоимостьОТ = Формат(СтоимостьОТ,"ЧЦ=9; ЧДЦ=2");
		ОблСтрока.Параметры.СтоимостьОТ_К = Формат(СтоимостьОТ*2,"ЧЦ=9; ЧДЦ=2");
		НормыSMD = РегистрыСведений.НормыЭлектроконтроля.ПолучитьПоследнее(Отчет.Период.ДатаОкончания,Новый Структура("МПЗ",ВыборкаСпецификация.ЭтапСпецификации));
		ОблСтрока.Параметры.НВ_ЭК = Формат(НормыSMD.НормаВремени,"ЧЦ=4; ЧДЦ=2");
		ОблСтрока.Параметры.РасценкаЭК = Формат(НормыSMD.Расценка,"ЧЦ=4; ЧДЦ=2");
		СтоимостьЭК = ВыборкаСпецификация.Количество*НормыSMD.Расценка;
		ОблСтрока.Параметры.СтоимостьЭК = Формат(СтоимостьЭК,"ЧЦ=9; ЧДЦ=2");
		ОблСтрока.Параметры.СтоимостьЭК_К = Формат(СтоимостьЭК*2,"ЧЦ=9; ЧДЦ=2");
		ОблСтрока.Параметры.СтоимостьИтого = СтоимостьУЭ*2.05+СтоимостьОТ*2+СтоимостьЭК*2;
		СебестоимостьПолная = ОблСтрока.Параметры.СтоимостьИтого/СтоимостьВсего*ПолнаяСуммаЗП/ВыборкаСпецификация.Количество;
		ОблСтрока.Параметры.СебестоимостьПолная = СебестоимостьПолная; 
		ТабДок.Вывести(ОблСтрока);
		КоличествоВсего = КоличествоВсего + ВыборкаСпецификация.Количество;
		ВремяИзготВсего = ВремяИзготВсего + ВремяИзгот;
		СтоимостьУЭВсего = СтоимостьУЭВсего + СтоимостьУЭ;
		СтоимостьОТВсего = СтоимостьОТВсего + СтоимостьОТ;
		СтоимостьЭКВсего = СтоимостьЭКВсего + СтоимостьЭК;
		СебестоимостьИзделияПолная = СебестоимостьИзделияПолная + СебестоимостьПолная;
		КонецЦикла;
			Если СохранитьДанныеСебестоимости Тогда
			РегистрСведенийСебестоимость = РегистрыСведений.Себестоимость.СоздатьМенеджерЗаписи();
			РегистрСведенийСебестоимость.Период = Отчет.Период.ДатаНачала;
	    	РегистрСведенийСебестоимость.Подразделение = СписокЛинеек[0].Значение.Подразделение;
	    	РегистрСведенийСебестоимость.Линейка = Справочники.Линейки.ПустаяСсылка();
		    РегистрСведенийСебестоимость.Номенклатура = ВыборкаИзделие.Изделие;
			РегистрСведенийСебестоимость.ЗарплатнаяЧасть = СебестоимостьИзделияПолная;
			РегистрСведенийСебестоимость.Записать(Истина);
			КонецЕсли;
	КонецЦикла;
ОблКонец.Параметры.КоличествоВсего = КоличествоВсего;
ОблКонец.Параметры.ВремяИзгот = Формат(ВремяИзготВсего,"ЧЦ=10; ЧДЦ=3");
ОблКонец.Параметры.СтоимостьУЭ = Формат(СтоимостьУЭВсего,"ЧЦ=9; ЧДЦ=2");
ОблКонец.Параметры.СтоимостьОТ = Формат(СтоимостьОТВсего,"ЧЦ=9; ЧДЦ=2");
ОблКонец.Параметры.СтоимостьЭК = Формат(СтоимостьЭКВсего,"ЧЦ=9; ЧДЦ=2");
ОблКонец.Параметры.СтоимостьУЭ_К = Формат(СтоимостьУЭВсего*2.05,"ЧЦ=9; ЧДЦ=2");
ОблКонец.Параметры.СтоимостьОТ_К = Формат(СтоимостьОТВсего*2,"ЧЦ=9; ЧДЦ=2");
ОблКонец.Параметры.СтоимостьЭК_К = Формат(СтоимостьЭКВсего*2,"ЧЦ=9; ЧДЦ=2");
ОблКонец.Параметры.СтоимостьВсего = Формат(СтоимостьУЭВсего*2.05+СтоимостьОТВсего*2+СтоимостьЭКВсего*2,"ЧЦ=9; ЧДЦ=2");
ОблКонец.Параметры.ПолнаяСуммаЗП = ПолнаяСуммаЗП;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		//Если ОбщийМодульВызовСервера.РазрешенныйСписокЛинеек(СписокЛинеек) Тогда
		СформироватьНаСервере();		
		//КонецЕсли;
	КонецЕсли; 
КонецПроцедуры
